# Тестирование примеров по функциям для домашнего задания по лекции 2.1
# Домашнее задание по лекции 2.1 по функциям: https://github.com/netology-code/py-homework-basic/tree/master/2.1.functions
# 1:36:36 - разъяснение по домашнему заданию

# Каталог документов хранится в следующем виде:
documents = [
    {"type": "passport", "number": "2207 876234", "name": "Василий Гупкин"},
    {"type": "invoice", "number": "11-2", "name": "Геннадий Покемонов"},
    {"type": "insurance", "number": "10006", "name": "Аристарх Павлов"}
]
# Перечень полок, на которых находятся документы, хранится в следующем виде:
directories = {
    '1': ['2207 876234', '11-2', '5455 028765'],
    '2': ['10006', '5400 028765', '5455 002299'],
    '3': []
}
